export const getCategoryColor = (category: string): string => {
    const colorMap: { [key: string]: string } = {
        "อื่นๆ": "#0A9ACA",
        "การนำเข้า ส่งออก": "#EBA609",
        "การปฏิบัติงานของเจ้าหน้าที่": "#5C17D4",
        "เกษตร & ราคาสินค้า": "#5B9E05",
        "e-Commerce/คุ้มครองผู้บริโภค": "#0ACB8E",
        "ปริมาณราคาสินค้าและบริการ/พฤติกรรมทางการค้าที่ไม่เป็นธรรม/ราคาสินค้าอุปโภคบริโภค": "#D83BE0",
        "ข้อพิพาททางการค้าระหว่างประเทศ/ตรวจสอบความน่าเชื่อถือของบริษัท": "#F79009",
        "ระบบราชการ/ความล่าช้า": "#00FFFF",
        "สินค้าราคาแพง/เงินเฟ้อ": "#FE2D92",
        "สินค้าส่งออก/การแสดงสินค้าทั้งในและต่างประเทศ": "#92DA6B",
        "เครื่องหมายการค้า/ลิขสิทธิ์/สิทธิบัตร": "#CC6116",
        "บัญชีม้า/นอมินี": "#C00E0E",
        "คุณภาพสินค้านำเข้า/ปลอมตราไทย": "#FF156B",
        "งานจดทะเบียนนิติบุคล": "#C09CFF",
        "การชั่ง ตวง วัด": "#2C2CF6",
    };
    
    return colorMap[category] || '#6B7280';
};